module.exports.config = {
  name: "/",
  version: "1.0.1",
  permission: 0,
  credits: "★OMOR ALVI★",
  prefix: false,
  description: "goibot",
  category: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};
module.exports.handleEvent = async function ({
  api: _0x297672,
  event: _0x3f3898,
  args: _0x58797d,
  Threads: _0x4f171f,
  Users: _0x5c5795
}) {
  var _0x267a6f = await _0x5c5795.getNameUser(_0x3f3898.senderID);
  var _0x1763c6 = ["এতো বট বলে বলে চিল্লাইবার কি আছে 😫😈-?? আল্লাহ কে ডাকতে পারিস নাহ🥹 ", "শুনবো না😼 তুমি আল্লাহ কে না ডেকে আমাকে ডাকছো 🙂৷ আল্লাহ কে ডাকো আমাকে নাহ", "এই সময় টা আমার সাথে নষ্ট না করে আল্লাহ জিকিরে দিলে কি হয়🥺💙", "তুমি আল্লাহ কে ডাকো-সে তুমার এক মাত্রো মালিক", "আমাকে ডাকলে তুমার জিবনে আসন্তি আসবে নাহ-আল্লাহ কে ডাকো-মনে সান্তি আসবে", "তুমি এই গ্রুপ এ বট বট বলে কান্না করো🙂 আর তুমার জন্য যে আমাদের প্রিয় নবি মোহাম্মদ (সা:) উম্মাতি উম্মাতি বলে কাদছেন আজ সেই দিকে তুমার খেয়াল নেই🙂", "জীবনে তুমি যে টুকু সময় নষ্ট করছো-সে টুকু সময় নামাজে দিলেও পারতে", "আল্লাহ তুমাকে হেদায়েত দান করুক আমাকে বট বলে বকার জন্য", "প্রিয় ভালো যদি বাসতেই হয় আমাদের প্রিয় নবি মোহাম্মদ (সা:) কে ভালোবাস", "যেই দুনিয়া নিয়ে এতো উল্লাস এতো খমতা তুমাদের - একদিন এই দুনিয়া ছেরে চলে যেতে হবে তুমাকে ", "খারাপ বন্ধু গুলা তুমার পাপের ভার নিবে নাহ", "আমাকে না ডেকে জান্নাত এ জাবার জন্য আল্লাহ কে ডাকো", "তুমি ভালো কাজ করো সবাই খারাপ বললেও ওই আল্লাহ উপর থেকে তুমাকে ডাকবেন", "ভালো কাজ করো ভালো ফলাফল পাবে ইনশাল্লাহ ", "প্রতিদিন এর ভালো কিংবা খারাপ কাজ তুমাকে দিতে হয় নাহ-তাই বলে যে তুমি পার পেয়ে যাবে তাই নাহ -!! এক দিন ঠিক আল্লাহ কে তুমার কাজের হিসাব দিতে হবে হাসর এর ময়দানে🥹🥺", "জীবন সুন্দর হবে তুমি নামাজি হয়ে যাও", "সময় ফুরিয়ে গেলে আমল করার সময় পাবে নাহ ", "রাস্তার অসহায় ইয়াতিম শিশু দের দেখো তারা এতো কষ্টে থাকার পরেও দিন শেষে আল্লার শুকরিয়া আদায় করে ", "তুমি যেমনি আছো ১ মিনিট এর জন্য বলতে পারবে নাহ আল্লাহামদুলিল্লাহ...❤️🌸", "তুমাকে একমাত্রো আল্লাহ  পারেন তুমার জীবন সুন্দর করে দিতে", "আল্লাহামদুলিল্লাহ আমি আঁখিরি নবির উম্মত - তুমি?", "যাকে ভালোবাসলে কনো লস নেই তিনি হলে আল্লাহ", "তুমি যত বড় গুনহা করো নাহ কেনো,আল্লাহর কাছে মন থেকে ক্ষমা চাউ তিনি তুমাকে ক্ষমা করে দিবেন", "আল্লাহ দয়া শিল, -দুনিয়াতে ১% ভালোবাসা দিয়েছেন আর তার নিজের কাছে ৯৯% রেখে দিয়েছেন তুমাদের জন্য ", "তুমি একজন নারি কে ভালোবেসে দু:ক্ষ্য ছাড়া কিছু পাবে নাহ🙂, আল্লাহ কে ভালো বেসে দেখো তুমার কনো কিছুর কমতি হবে নাহ🌸❤️", "সন্দর করে জীবন জাপন করতে চাও তাহলে নামাজে লুটিয়ে পরো", "আর কত বার ডাকবি ,শুনছি তো", "এতো সুন্দর দুনিয়া পেয়েছো তার জন্য একবার ও আল্লাহর প্রশংসা করবে নাহ", "তুমি সয়তান এর পাল্লায় পরে তুমার মালিক কে বুলে যেও নাহ", "ভালো কাজ দিয়ে দেখিয়ে দাও তুমি আসোলে কতো টা ভালো", "আল্লাহর কাজ করতে সবাই কে সাহায্য করো", "আল্লাহর দিন ও তার মহিমা তুমার চার পাসের মানুষ গুলোকে ছরিয়ে দাও", "আল্লাহ কে ভয় করো কারন তিনি চাইলে ১ সেকেন্ডে তুমার জীবন পালটে দিতে পারেন", " তুমার আম্মু আব্বুকে সম্মান করো ভালো বাসো - তা না হলে তুমাকে ও একদিন বাবা - মা হতে হবে বুজে নিও🙂 আর আল্লাহ তো আছেন তিনি সব দেখেন😊❤️"];
  var _0x343d76 = _0x1763c6[Math.floor(Math.random() * _0x1763c6.length)];
  if (_0x3f3898.body.toLowerCase() == "namaz" || _0x3f3898.body.toLowerCase() == "namaz porte jabe nah") {
    return _0x297672.sendMessage("জীবন কে সুন্দর করতে চাউ? তাহলে নামাজে লুটিয়ে পরো-!!🤗", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '😭' || _0x3f3898.body.toLowerCase() == '😭') {
    return _0x297672.sendMessage("তুমি কার জন্য কাদো নামাজে -?? আল্লার কাছে তুমি তার জন্য কাদো - জিনি হাসরের ময়দানে ইয়া মুম্মাতি ইয়া উম্মাতি বলতে কাদবে তুমার জন্য🥺❤️", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '👍' || _0x3f3898.body.toLowerCase() == "👍🏻") {
    return _0x297672.sendMessage("কি হবে ভারচুয়াল জগতে এসে সময় নষ্ট করে-!!🙂 ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "আসসালামু আলাইকুম" || _0x3f3898.body.toLowerCase() == "assalamu alaikum") {
    return _0x297672.sendMessage("ওয়ালাইকুম সালাম-!!🖤💫", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'hi' || _0x3f3898.body.toLowerCase() == "hello" || _0x3f3898.body.toLowerCase() == 'by' || _0x3f3898.body.toLowerCase() == "helo") {
    return _0x297672.sendMessage("Hi,Hello,By এই গুলা করে কোনো লাভ নেই - তুমি আল্লাহর জন্য পারিশ্রমিক দিয়ে কাজ করো তিনি তুমার কাজ এর সম্মান  নিজে হাতে তুলে দিবেন ইনশাল্লাহ-!!🤍😊", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'bc' || _0x3f3898.body.toLowerCase() == 'mc') {
    return _0x297672.sendMessage("যে গালা গালি করে তার জন্য কেয়ামতে রয়েছে ভয়াবহ সাজা🥺 ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "khankir pula" || _0x3f3898.body.toLowerCase() == "madarcud") {
    return _0x297672.sendMessage("মানুষ কে সম্মান করা আমাদের নবিজির আদর্শ মানুষ এর মনে কষ্ট দিয়ে তাকে ছোট করা নয়🤗", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "sem" || _0x3f3898.body.toLowerCase() == "ami o") {
    return _0x297672.sendMessage('oh', _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "anyone" || _0x3f3898.body.toLowerCase() == "any") {
    return _0x297672.sendMessage(" একটু ভালো-বাসা দিবে আমায়🥺❤️", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "tumar nam ki" || _0x3f3898.body.toLowerCase() == "tumar name ki " || _0x3f3898.body.toLowerCase() == "tor name ki" || _0x3f3898.body.toLowerCase() == "তুমার নাম কি") {
    return _0x297672.sendMessage("ji amar name Islamic Chat Bot\nby: Muslim Hakcer BD", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "kothay thaken" || _0x3f3898.body.toLowerCase() == "kothay thako") {
    return _0x297672.sendMessage("‎আমি সব সময় গ্রুপ এ থাকি গ্রুপ এর মানুষ গুলো কে ইসলাম এর পথে নিয়ে আসার জন্য ইসলামিক বার্তা দিতে থাকি", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "তুমার কি কোনো কাজ নেই" || _0x3f3898.body.toLowerCase() == "tumar ki kono kaj nai") {
    return _0x297672.sendMessage("জি আমার একটাই কাজ - গ্রুপ এ থাকা সবাই কে ইসলাম এর দাওয়াত দেওয়া", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "Allahamdulilah" || _0x3f3898.body.toLowerCase() == "আল্লাহামদুলিল্লাহ") {
    return _0x297672.sendMessage("আপনি যেমনি থাকেন নাহ কেনো যেই অবস্থা থাকেন নাহ কেনো - আল্লাহর শুকরিয়া আদায় করেন এবং আল্লাহামদুলিল্লাহ বলেন🌸❤️", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "Allah" || _0x3f3898.body.toLowerCase() == "allah") {
    return _0x297672.sendMessage("তিনি পরম দয়ালু ও ওসিম এই দুনিয়ার সকল কিছুর এক মাত্রো মালিক  মহান আল্লাহ❤️😍", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'মা' || _0x3f3898.body.toLowerCase() == "বাবা") {
    return _0x297672.sendMessage("মা-বাবা কে সম্মান করুন - কেননা এই মা বাবার জন্যই আজ আপনি এতো বড়ো হতে পেরেছেন ❤️😊 যাদের মা বাবা নেই তারাই বুজে দুনিয়া টা কেমন 😔", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "chup" || _0x3f3898.body.toLowerCase() == "stop" || _0x3f3898.body.toLowerCase() == "চুপ" || _0x3f3898.body.toLowerCase() == "chup kor") {
    return _0x297672.sendMessage("কেনো আমি কিছু বলেই দোষ 🥺", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "bts" || _0x3f3898.body.toLowerCase() == "btc") {
    return _0x297672.sendMessage("এদের অনুসরণ করা মানুষ গুলো ইসলাম এর অন্তর্ভুক্ত হতে পারে নাহ🥲", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "sorry" || _0x3f3898.body.toLowerCase() == "sorry" || _0x3f3898.body.toLowerCase() == "sorry" || _0x3f3898.body.toLowerCase() == "sorry") {
    return _0x297672.sendMessage("sorry আল্লাহ কে বলো আমাকে নাহ🥺🙂", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "কলা" || _0x3f3898.body.toLowerCase() == "benana" || _0x3f3898.body.toLowerCase() == "কলা" || _0x3f3898.body.toLowerCase() == '🍌') {
    return _0x297672.sendMessage("জান্নাত এর প্রোথম ফল খেতে দিবে কলা 🍌", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "jannat" || _0x3f3898.body.toLowerCase() == "জান্নাত") {
    return _0x297672.sendMessage("️তুমি জান্নাতে জাবার জন্য প্রস্তুত হউ - কেনো না তুমার এই দুনিয়া থেকে জান্নাত শত গুন বেশি সুন্দর- সুভানাল্লা😍❤️", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "tnx you" || _0x3f3898.body.toLowerCase() == "tnx" || _0x3f3898.body.toLowerCase() == "thank you bot" || _0x3f3898.body.toLowerCase() == "thank you sir") {
    return _0x297672.sendMessage("️আপনাকেও ধন্যবাদ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '😡' || _0x3f3898.body.toLowerCase() == '😤' || _0x3f3898.body.toLowerCase() == '😈' || _0x3f3898.body.toLowerCase() == '🤬' || _0x3f3898.body.toLowerCase() == '😾') {
    return _0x297672.sendMessage("রাগ তো সয়তান এর - তুমি কেন রাগ করবে আল্লাহর বান্দা হয়ে", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '🐸' || _0x3f3898.body.toLowerCase() == '🐸') {
    return _0x297672.sendMessage("️ব্যাং খাওয়া হারাম তাই - এদের দরে হত্তা করা বন্ধ করুন😔", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "Jahannam" || _0x3f3898.body.toLowerCase() == "jahannam" || _0x3f3898.body.toLowerCase() == "জাহান্নাম") {
    return _0x297672.sendMessage("️প্রিয় ভাই ও বন আমার তুমি দুনিয়ার মায়া ও সয়তান এর পাল্লায় পরে আল্লাহ কে বুলে যেও নাহ - আর সয়তান এর সাথে মিশে খারাপ ও পাপ কাজে লিপ্ত হয়ে যেও নাহ - তুমি খারাপ কাজে লিপ্ত হয়ে গেলে তুমার জন্য অপেক্ষা করবে ভয়া বহ জাহান্নাম", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'oh' || _0x3f3898.body.toLowerCase() == 'oh') {
    return _0x297672.sendMessage("️hmm", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "জুম্মাহ" || _0x3f3898.body.toLowerCase() == "jummah") {
    return _0x297672.sendMessage("️আমাদের মুসলিম দের এক বিশেষ দিন জুম্মাহ্র দিন ❤️🌺", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "buda" || _0x3f3898.body.toLowerCase() == "heda") {
    return _0x297672.sendMessage("️আজে বাজে কথা বলে মুখ নষ্ট করে নিজেকে ছোট্ট করো নাহ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "ki koren" || _0x3f3898.body.toLowerCase() == "ki koro") {
    return _0x297672.sendMessage("️আমি ইসলাম প্রোচার এর জন্য বেস্ত আছি আপনি", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '🙂' || _0x3f3898.body.toLowerCase() == '🙃') {
    return _0x297672.sendMessage("️যেই প্রিয় জিনিস তুমার থেকে হারিয়ে গেছে - আল্লাহ নিয়ে নিছেন তার জন্য তুমি কেদো নাহ - কারন আল্লাহ মহান😌😇 তুমার জন্য এর থেকেও উত্তম কিছু তুমার জন্য রেখেছেন যা তুমার সামনে আল্লাহ খুব সিগ্রহি নিয়ে আসবেন 😊❤️", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '😒' || _0x3f3898.body.toLowerCase() == '🙄') {
    return _0x297672.sendMessage("️ তুমি চিন্তা করে দেখো তুমার সব কিছুই আছেন আল্লাহামদুলিল্লাহ তাও তুমি নামাজ পরো না আল্লাহর কালাম পরো না😐", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "তুমি কে" || _0x3f3898.body.toLowerCase() == "tumi ke" || _0x3f3898.body.toLowerCase() == "tui ke") {
    return _0x297672.sendMessage("️আমি একজন ইসলামিক রোবোট আমাকে প্রোগ্রামিং করে বানানো হয়েছে - Islamick chat", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "🤦‍♂️" || _0x3f3898.body.toLowerCase() == "🤦‍♀️") {
    return _0x297672.sendMessage("যত কষ্ট থাকো নাহ কেনো - তুমি আল্লাহর কাছে সাহায্য চাও - অযথা কপালে হাত দিও নাহ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '😂' || _0x3f3898.body.toLowerCase() == '😁' || _0x3f3898.body.toLowerCase() == '😆' || _0x3f3898.body.toLowerCase() == '🤣' || _0x3f3898.body.toLowerCase() == '😸' || _0x3f3898.body.toLowerCase() == '😹') {
    return _0x297672.sendMessage("তুমি এই দুনিয়াতে জেই অবস্থায় থাকো না কেনো আল্লাহর শুক্রিয়া আদায় করো না হলে এই শুখ টা আজ আছে এখন আছে কিছু খন পর নাও থাকতে পারে", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == '💞' || _0x3f3898.body.toLowerCase() == '💖' || _0x3f3898.body.toLowerCase() == '💝' || _0x3f3898.body.toLowerCase() == "❤️‍🩹") {
    return _0x297672.sendMessage("যদি সত্যি কাওকে ভালোবাসতে হয় আমার আল্লহ কে ভালো বাসো তুমি জিতবে ১০০%", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "kemon acho" || _0x3f3898.body.toLowerCase() == "কেমন আছো" || _0x3f3898.body.toLowerCase() == "kemon acho" || _0x3f3898.body.toLowerCase() == "how are you" || _0x3f3898.body.toLowerCase() == "how are you?") {
    return _0x297672.sendMessage("আল্লাহামদুলিল্লাহ আমি ভালো আছি-!!❤️🕊️ \n আপনি কেমন আছেন প্রিয় ভাই |বন...? ", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'he' || _0x3f3898.body.toLowerCase() == " হে") {
    return _0x297672.sendMessage("অহ আচ্ছা আর কিছু বলবেন কি ??", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'na' || _0x3f3898.body.toLowerCase() == "nah") {
    return _0x297672.sendMessage("oh accha", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == 'ok' || _0x3f3898.body.toLowerCase() == "ওকে") {
    return _0x297672.sendMessage("hmmm😇", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "hmm" || _0x3f3898.body.toLowerCase() == "হুম") {
    return _0x297672.sendMessage('oh', _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "vai" || _0x3f3898.body.toLowerCase() == "bai") {
    return _0x297672.sendMessage("জি বলেন", _0x181276);
  }
  ;
  if (_0x3f3898.body.toLowerCase() == "vai ektu help korben" || _0x3f3898.body.toLowerCase() == "ektu help korben") {
    return _0x297672.sendMessage("জি বলেন কি help করতে পারি আপনাকে?? ", _0x181276);
  }
  ;
  mess = "{name}";
  if (_0x3f3898.body.indexOf("বট") == 0 || _0x3f3898.body.indexOf("বোট") == 0) {
    var _0xd60328 = {
      'body': _0x267a6f + ", " + _0x343d76
    };
    return _0x297672.sendMessage(_0xd60328, _0x181276, _0x519412);
  }
  ;
};
module.exports.run = function ({
  api: _0x2fed29,
  event: _0x62bc2,
  client: _0x36dc40,
  __GLOBAL: _0x19ad78
}) {};
